**Шепелев Д.**

# **1. Выполните задание из файла**

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('titanic.csv', index_col='PassengerId')
df.head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [3]:
df.shape

(891, 11)

In [18]:
df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [5]:
df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

## **1. Какое количество мужчин и женщин ехало на корабле?**

In [7]:
df1 = df.set_index('Sex')
print(f"{len(df1.loc['male'].index)} {len(df1.loc['female'].index)}")

577 314

## **2. Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров.**

In [8]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [9]:
survived = df['Survived'].value_counts()[1]
survived_percentage = 100.0 * survived / df.shape[0]
print('%.2f' % survived_percentage)

38.38

## **3. Какую долю пассажиры первого класса составляли среди всех пассажиров?**

In [10]:
first_class = df['Pclass'].value_counts()[1]
first_class_percentage = 100.0 * first_class / df.shape[0]
print('%.2f' % first_class_percentage)

24.24

## **4. Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров.**

In [11]:
print('%.2f %.2f' % (df['Age'].mean(), df['Age'].median()))

29.70 28.00

## **5. Коррелируют ли число братьев/сестер с числом родителей/детей?**

In [12]:
corr = df['SibSp'].corr(df['Parch'])
print('%.2f' % corr)

0.41

## **6. Какое самое популярное женское имя на корабле?**

In [13]:
def parse_first_name_female(name):
    first = name.str.extract(r"Mrs\.\s+[^(]*\((\w+)", expand=False)
    first.loc[first.isna()] = name.str.extract(r"\.\s+(\w+)", expand=False)
    return first

In [14]:
names = parse_first_name_female(df.loc[df['Sex'] == 'female', 'Name'])

In [16]:
names.value_counts()

Anna         15
Mary         14
Elizabeth    11
Margaret     10
Alice         7
             ..
Miriam        1
Helmina       1
Laura         1
Nora          1
Gerda         1
Name: Name, Length: 177, dtype: int64

In [17]:
print(names.value_counts().index[0])

Anna

# **2. Прочитайте и разберитесь, что такое машинное обучение, какие задачи можно решать  с  его  помощью.**

**Машинное обучение** - класс методов искусственного интеллекта, характерной чертой которых является использования для решения задач совокупности средств математической статистики, численных методов, математического анализа, методов оптимизации и теории вероятностей.

**Разделяют несколько способов машинного обучения:**
1. Обучение с учителем - известны пары (входные данные, результат);
2. Обучение без учителя - известны только входные данных, есть необходимость сгруппировать данные по признакам и/или понизить размерность;
3. Обучение с подкреплением - в ходе обучения выявляется пара (ситуация, ответная реакция на ситуацию).

**Классические задачи, решаемые с помощью машинного обучения:**
1. Классификация
2. Кластериация
3. Регрессия
4. Понижение размерности данных
5. Детектирование аномалий